chore: refined documentation + implemented GitHub actions
